In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from sqlalchemy.engine import create_engine

%matplotlib inline

In [2]:
%load_ext sql
%config SqlMagic.displaylimit=50
%config SqlMagic.autopandas=True

In [3]:
%sql postgresql://imdb:imdb_admin@postgres:5432/imdb_database

In [4]:
connection = create_engine('postgresql://imdb:imdb_admin@postgres:5432/imdb_database')

You will need local copies of the csv files that populate the tables in this database, please [download](https://arch.library.northwestern.edu/downloads/44558d72q?locale=en) and unpack the tarball before proceeding with this exercise.

# Introduction to SQL (Structured Query Language)

##### Version 0.1

***

By Scott Coughlin (Northwestern IT Research Computing Services)  
20 July 2022

[Session 15](https://github.com/LSSTC-DSFP/LSSTC-DSFP-Sessions/tree/main/Sessions/Session15) is primarily concerned with handling our data with efficiency.

Ideally, for any and every task we want to desire solutions that operate *faster*.

This can be accomplished many different ways:

$~~~~~~$build algorithms that execute faster

$~~~~~~$spread calculations over many different computers simultaneously

$~~~~~~$find a compact storage solution for the data so it can be accessed more quickly

In our introduction to SQL we will start with simple queries of existing tables, and discuss creating your own tables using `pandas` as a challenge problem.

## Problem 1) IMDb Data

Throughout the session we will use information from the [Internet Movie Database (IMDb)](https://www.imdb.com/) to illustrate various principles regarding databases.

A quick note on the provenance of this data. The files we have used to populate this data set are from [this website](https://relational.fit.cvut.cz/dataset/IMDb) and it may not be a list of every single movie on IMDb (there are no movies after 2004).

#### Please note that you can make an SQL command call from a jupyter cell by adding "%sql" in front of the SQL command you want to run, see examples below
```
## Perform a SQL command and see the results of the query
%sql SELECT * FROM imbd_movies;

## If you save to a variable, in this case "result", then the variable will be a `pandas` DataFrame based on the result of the query
result = %sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10; 
```

Please execute the cell below to list all of the table names in the imbd_database database. You will want these table names to answer the questions that follow.

In [5]:
%sql \dt+

 * postgresql://imdb:***@postgres:5432/imdb_database
4 rows affected.

   Schema                   Name   Type Owner     Size Description
0  public         imdb_directors  table  imdb  4720 kB        None
1  public            imdb_movies  table  imdb    26 MB        None
2  public  imdb_movies_directors  table  imdb    16 MB        None
3  public     imdb_movies_genres  table  imdb    17 MB        None

In [23]:
imdb_movies = %sql SELECT * FROM imdb_movies;
imdb_directors = %sql SELECT * FROM imdb_directors
imdb_movies_directors = %sql SELECT * FROM imdb_movies_directors
imdb_movies_genres = %sql SELECT * FROM imdb_movies_genres

 * postgresql://imdb:***@postgres:5432/imdb_database
355146 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
86880 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
371180 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
395119 rows affected.

**Problem 1a**

Using SQL, SELECT 10 movies from the imbd_movies table. Select 10 directors from imbd_directors and order by `first_name`.

In [6]:
%sql SELECT * FROM imdb_movies LIMIT 10;

 * postgresql://imdb:***@postgres:5432/imdb_database
10 rows affected.

   movie_id                                 name  year  rank
0         0                                  #28  2002   0.0
1         1  #7 Train: An Immigrant Journey, The  2000   0.0
2         2                                    $  1971   6.4
3         3                        $1,000 Reward  1913   0.0
4         4                        $1,000 Reward  1915   0.0
5         5                        $1,000 Reward  1923   0.0
6         6                      $1,000,000 Duck  1971   5.0
7         7               $1,000,000 Reward, The  1920   0.0
8         8               $10,000 Under a Pillow  1921   0.0
9         9                          $100,000.00  1915   0.0

In [8]:
%sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10;

 * postgresql://imdb:***@postgres:5432/imdb_database
10 rows affected.

   director_id first_name       last_name
0         7494         A.      Bistritsky
1        13355         A.       Champeaux
2         7125         A.       Bhimsingh
3         3728         A.           Babes
4         4871         A.      Barr-Smith
5         8026         A.          Bobrov
6         4175         A.    Balakrishnan
7         6779         A.           Berry
8         1114         A.     Aleksandrov
9        13475         A.  Chandrasekaran

**Problem 1b**

Using SQL, how many movies are there? How many directors are there?

In [9]:
%sql SELECT COUNT(*) FROM imdb_movies;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

    count
0  355146

In [10]:
%sql SELECT COUNT(*) FROM imdb_directors;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  86880

*Write your answer here*

**Problem 1c**

Using SQL, determine how many movies are there after the year 2000?

In [11]:
%sql SELECT COUNT(*) FROM imdb_movies WHERE year > 2000;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  39586

*Write your answer here*

**Problem 1d**

How many different movie genres are there?

In [12]:
%sql SELECT DISTINCT genre FROM imdb_movies_genres;

 * postgresql://imdb:***@postgres:5432/imdb_database
21 rows affected.

          genre
0     Animation
1         Crime
2       Romance
3   Documentary
4       Mystery
5       Musical
6         Music
7     Film-Noir
8       Fantasy
9         Short
10        Adult
11       Horror
12        Drama
13       Action
14     Thriller
15       Sci-Fi
16      Western
17       Comedy
18    Adventure
19          War
20       Family

*Write your answer here*

## Problem 2) Joins

We started this exercise with a goal of being efficient. And yet, the data have been organized across 4 different files (each sheet is effectively a unique csv file).

**Problem 2a**

Join `imdb_movies` and `imdb_movies_genres` together

In [13]:
%sql SELECT * FROM imdb_movies as s INNER JOIN imdb_movies_genres as t ON s.movie_id = t.movie_id;

 * postgresql://imdb:***@postgres:5432/imdb_database
395119 rows affected.

        movie_id                    name  year  rank  movie_id      genre
0             13  $21 a Day Once a Month  1941   0.0        13  Animation
1             13  $21 a Day Once a Month  1941   0.0        13      Short
2             18              $40,000.00  1996   9.6        18     Comedy
3             31                   $pent  2000   4.3        31      Drama
4             73              burbs, The  1989   5.9        73     Comedy
...          ...                     ...   ...   ...       ...        ...
395114    378593                 arkadas  1971   0.0    378593      Drama
395115    378599             kisilik ask  2004   0.0    378599      Drama
395116    378604     tekerlekli bisiklet  1962   0.0    378604      Drama
395117    378605        yetimin izdirabi  1956   0.0    378605      Drama
395118    378610                nc sayfa  1999   7.0    378610      Drama

[395119 rows x 6 columns]

*write your answer here*

**Problem 2b**

Join `imdb_movies`, `imdb_movies_directors` and `imdb_directors` together

In [15]:
%sql SELECT * FROM imdb_movies as movies INNER JOIN imdb_movies_directors as m_d ON movies.movie_id = m_d.movie_id INNER JOIN imdb_directors as directors on m_d.director_id = directors.director_id

SyntaxError: invalid syntax (<ipython-input-15-badd76bfd4c4>, line 2)

*write your answer here*

## Problem 3) Groups and Aggregates

Now that we know why the data has been organized in this way, we can leverage this unique structure in order to learn interesting properties of the data.

**Problem 3a**

In which year were the most movies made according to IMDb?

In [16]:
%sql SELECT COUNT(*), year FROM imdb_movies GROUP BY year ORDER BY count DESC;

 * postgresql://imdb:***@postgres:5432/imdb_database
120 rows affected.

     count  year
0    10337  2002
1    10119  2003
2    10107  2000
3    10002  2001
4     9389  1999
..     ...   ...
115      6  1891
116      3  1890
117      2  1893
118      2  1888
119      1  2008

[120 rows x 2 columns]

*write your answer here*

**Problem 3b**

How many "Action" movies where made after the year 1980? Before the year 1980?

In [18]:
%sql SELECT COUNT(*), genre FROM imdb_movies s INNER JOIN imdb_movies_genres t ON s.movie_id = t.movie_id WHERE year >1980 GROUP BY genre;

 * postgresql://imdb:***@postgres:5432/imdb_database
20 rows affected.

    count        genre
0   10135       Action
1    6437        Adult
2    4030    Adventure
3    6359    Animation
4   21169       Comedy
5    5881        Crime
6   20871  Documentary
7   32463        Drama
8    5075       Family
9    3331      Fantasy
10   4700       Horror
11   3799        Music
12   1729      Musical
13   2122      Mystery
14   6208      Romance
15   3420       Sci-Fi
16  30189        Short
17   7503     Thriller
18   1382          War
19    451      Western

In [19]:
%sql SELECT COUNT(*), genre FROM imdb_movies s INNER JOIN imdb_movies_genres t ON s.movie_id = t.movie_id WHERE year <1980 GROUP BY genre;

 * postgresql://imdb:***@postgres:5432/imdb_database
21 rows affected.

    count        genre
0    4090       Action
1     835        Adult
2    4640    Adventure
3   11139    Animation
4   34782       Comedy
5    6490        Crime
6   20007  Documentary
7   39520        Drama
8    5872       Family
9    1687      Fantasy
10    410    Film-Noir
11   2239       Horror
12   1670        Music
13   5162      Musical
14   2696      Mystery
15   7301      Romance
16   1405       Sci-Fi
17  50295        Short
18   2906     Thriller
19   2925          War
20   7889      Western

*write your answer here*

**Problem 3c**

Select all films made by `Scorsese`. How many are there?

In [20]:
%sql SELECT * FROM imdb_movies as movie INNER JOIN imdb_movies_directors as m_d on movie.movie_id = m_d.movie_id INNER JOIN imdb_directors as d on m_d.director_id = d.director_id WHERE  d.last_name = 'Scorsese'

 * postgresql://imdb:***@postgres:5432/imdb_database
38 rows affected.

,movie_id,name,year,rank,director_id,movie_id,director_id,first_name,last_name
0,8183,"Age of Innocence, The",1993,7.1,71645,8183,71645,Martin,Scorsese
1,7842,After Hours,1985,7.4,71645,7842,71645,Martin,Scorsese
2,13395,Amazing Stories: Book Four,1992,0.0,71645,13395,71645,Martin,Scorsese
3,10702,Alice Doesn't Live Here Anymore,1974,7.3,71645,10702,71645,Martin,Scorsese
4,13804,American Boy: A Profile of: Steven Prince,1978,6.9,71645,13804,71645,Martin,Scorsese
5,25192,"Aviator, The",2004,0.0,71645,25192,71645,Martin,Scorsese
6,47130,Bringing Out the Dead,1999,6.7,71645,47130,71645,Martin,Scorsese
7,37304,"Big Shave, The",1967,7.0,71645,37304,71645,Martin,Scorsese
8,42328,Bob Dylan Anthology Project,2005,0.0,71645,42328,71645,Martin,Scorsese
9,27108,Bad,1987,0.0,71645,27108,71645,Martin,Scorsese
10,45312,Boxcar Bertha,1972,5.8,71645,45312,71645,Martin,Scorsese
11,67388,"Color of Money, The",1986,6.8,71645,67388,71645,Martin,Scorsese
12,54209,Cape Fear,1991,7.1,71645,54209,71645,Martin,Scorsese
13,56304,Casino,1995,7.7,71645,56304,71645,Martin,Scorsese
14,82967,"Departed, The",2006,0.0,71645,82967,71645,Martin,Scorsese
15,163730,Italianamerican,1974,7.8,71645,163730,71645,Martin,Scorsese
16,163603,"It's Not Just You, Murray!",1964,6.5,71645,163603,71645,Martin,Scorsese
17,123849,Gangs of New York,2002,7.3,71645,123849,71645,Martin,Scorsese
18,131780,Goodfellas,1990,8.6,71645,131780,71645,Martin,Scorsese
19,177369,"King of Comedy, The",1983,7.5,71645,177369,71645,Martin,Scorsese
20,185704,"Last Temptation of Christ, The",1988,7.4,71645,185704,71645,Martin,Scorsese
21,181766,Kundun,1997,7.0,71645,181766,71645,Martin,Scorsese
22,183593,Lady by the Sea: The Statue of Liberty,2004,0.0,71645,183593,71645,Martin,Scorsese
23,185751,"Last Waltz, The",1978,7.7,71645,185751,71645,Martin,Scorsese
24,193231,Location Production Footage: The Last Temptati...,1988,0.0,71645,193231,71645,Martin,Scorsese
25,199510,Made in Milan,1990,8.7,71645,199510,71645,Martin,Scorsese
26,209158,Mean Streets,1973,7.5,71645,209158,71645,Martin,Scorsese
27,212717,Michael Jackson: Video Greatest Hits - HIStory,1995,0.0,71645,212717,71645,Martin,Scorsese
28,214872,"Mio viaggio in Italia, Il",1999,8.3,71645,214872,71645,Martin,Scorsese
29,230947,New York Stories,1989,6.2,71645,230947,71645,Martin,Scorsese
30,230963,"New York, New York",1977,6.3,71645,230963,71645,Martin,Scorsese
31,253470,Personal Journey with Martin Scorsese Through ...,1995,0.0,71645,253470,71645,Martin,Scorsese
32,316709,Street Scenes,1970,5.3,71645,316709,71645,Martin,Scorsese
33,270971,Raging Bull,1980,8.4,71645,270971,71645,Martin,Scorsese
34,362473,What's a Nice Girl Like You Doing in a Place L...,1963,6.4,71645,362473,71645,Martin,Scorsese
35,364368,Who's That Knocking at My Door?,1967,6.3,71645,364368,71645,Martin,Scorsese
36,326155,Taxi Driver,1976,8.4,71645,326155,71645,Martin,Scorsese
37,352863,Vesuvius VI,1959,9.4,71645,352863,71645,Martin,Scorsese

*write your answer here*

**Problem 3c**

According the the IMDb data, which director has directed the most movies?

In [21]:
%%sql 
SELECT * FROM imdb_directors as d INNER JOIN (
SELECT COUNT(*), m_d.director_id
FROM imdb_movies as movie
INNER JOIN imdb_movies_directors as m_d
    on movie.movie_id = m_d.movie_id
INNER JOIN imdb_directors as d
    on m_d.director_id = d.director_id
GROUP BY m_d.director_id) as movies_by_directors
ON movies_by_directors.director_id = d.director_id ORDER BY count DESC;

 * postgresql://imdb:***@postgres:5432/imdb_database
77434 rows affected.

       director_id                  first_name  last_name  count  director_id
0            25116                        Dave  Fleischer    615        25116
1            56530                     Georges     Méliès    554        56530
2            30570                        D.W.   Griffith    530        30570
3             1958  Gilbert M. 'Broncho Billy'   Anderson    360         1958
4            24576                       Louis  Feuillade    345        24576
...            ...                         ...        ...    ...          ...
77429        74542                  Michael A.      Smith      1        74542
77430        74549                        Mona      Smith      1        74549
77431        74552                  Neil (III)      Smith      1        74552
77432        74558                    Paul (I)      Smith      1        74558
77433        74560                     Paul D.      Smith      1        74560

[77434 rows x 5 columns]

*write your answer here*

**Problem 3d**

According the the IMDb data, which director has directed the most movies in each genre?

In [22]:
%%sql
SELECT * FROM imdb_directors as d INNER JOIN (
SELECT COUNT(*), m_d.director_id, m_g.genre
FROM imdb_movies_genres as m_g
INNER JOIN imdb_movies_directors as m_d
    on m_g.movie_id = m_d.movie_id
GROUP BY m_d.director_id, m_g.genre) as movies_by_directors
ON movies_by_directors.director_id = d.director_id ORDER BY genre, count DESC

 * postgresql://imdb:***@postgres:5432/imdb_database
154778 rows affected.

        director_id   first_name        last_name  count  director_id    genre
0             21656  Kevin (III)             Dunn     48        21656   Action
1             13493         Cheh            Chang     36        13493   Action
2             34703      Godfrey               Ho     35        34703   Action
3             64798           K.  Raghavendra Rao     34        64798   Action
4             70064     Cirio H.         Santiago     34        70064   Action
...             ...          ...              ...    ...          ...      ...
154773        72974        Edwin           Sherin      1        72974  Western
154774        34283         Fred          Hibbard      1        34283  Western
154775        69963    John (II)          Sanford      1        69963  Western
154776        27723         Nils             Gaup      1        27723  Western
154777        77041   C. Gardner         Sullivan      1        77041  Western

[154778 rows x 6 columns]

*write your answer here*

## Challenge Problem) Make your own tables

**Problem 1a**

Create a new TABLE.

In [23]:
%sql CREATE TABLE test_table1(column1 bigint, column2 text)

 * postgresql://imdb:***@postgres:5432/imdb_database
Done.

Empty DataFrame
Columns: []
Index: []

**Problem 1b**

INSERT 3 rows into the TABLE you made above

In [24]:
%sql INSERT INTO test_table1 VALUES(0, 'a');
%sql INSERT INTO test_table1 VALUES(1, 'b');
%sql INSERT INTO test_table1 VALUES(2, 'c');

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

Empty DataFrame
Columns: []
Index: []

In [25]:
%sql SELECT * FROM test_table1;

 * postgresql://imdb:***@postgres:5432/imdb_database
3 rows affected.

   column1 column2
0        0       a
1        1       b
2        2       c

**Problem 1c**

Create a pandas DataFrame and save as a SQL table

*** hint look at the `pandas.to_sql` documentation and note that we already made a "connection" variable called `connection` ***

In [26]:
table = pd.DataFrame({"colum1" : [0, 1], "column2" : ['a', 'b']})
table.to_sql("test_table", con=connection)

2

In [27]:
%sql SELECT * FROM test_table;

 * postgresql://imdb:***@postgres:5432/imdb_database
2 rows affected.

   index  colum1 column2
0      0       0       a
1      1       1       b

In [28]:
table = pd.DataFrame({"COLUMN" : [0, 1], "column2" : ['a', 'b']})
table.to_sql("test_table3", con=connection)

2

In [33]:
%sql SELECT "COLUMN" FROM test_table3;

 * postgresql://imdb:***@postgres:5432/imdb_database
2 rows affected.

   COLUMN
0       0
1       1